In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
train=pd.read_csv("titanic_train.csv")
test=pd.read_csv("titanic_test.csv")

In [3]:
df=pd.concat([train,test],ignore_index=True)

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

In [30]:
df.head()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
0,22.0,NaN,S,7.2500,"Braund, Mr. Owen Harris",0,1,3,male,1,0.0,A/5 21171
1,38.0,C85,C,71.2833,"Cumings, Mrs. John Bradley (Florence Briggs Th...",0,2,1,female,1,1.0,PC 17599
2,26.0,NaN,S,7.9250,"Heikkinen, Miss. Laina",0,3,3,female,0,1.0,STON/O2. 3101282
3,35.0,C123,S,53.1000,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",0,4,1,female,1,1.0,113803
4,35.0,NaN,S,8.0500,"Allen, Mr. William Henry",0,5,3,male,0,0.0,373450

In [5]:
df.shape

(1309, 12)

In [6]:
df1 = df.copy()

In [7]:
for key,value in df.iterrows():
    if(np.isnan(value['Survived'])):
        df1=df1.drop(key)

In [8]:
df1.tail()

,Age,Cabin,Embarked,Fare,Name,Parch,PassengerId,Pclass,Sex,SibSp,Survived,Ticket
886,27.0,NaN,S,13.00,"Montvila, Rev. Juozas",0,887,2,male,0,0.0,211536
887,19.0,B42,S,30.00,"Graham, Miss. Margaret Edith",0,888,1,female,0,1.0,112053
888,NaN,NaN,S,23.45,"Johnston, Miss. Catherine Helen ""Carrie""",2,889,3,female,1,0.0,W./C. 6607
889,26.0,C148,C,30.00,"Behr, Mr. Karl Howell",0,890,1,male,0,1.0,111369
890,32.0,NaN,Q,7.75,"Dooley, Mr. Patrick",0,891,3,male,0,0.0,370376

In [9]:
df1['Has_Cabin']=df1['Cabin'].isnull()==False

In [10]:
df1['Has_Cabin']

0      False
1       True
2      False
3       True
4      False
5      False
6       True
7      False
8      False
9      False
10      True
11      True
12     False
13     False
14     False
15     False
16     False
17     False
18     False
19     False
20     False
21      True
22     False
23      True
24     False
25     False
26     False
27      True
28     False
29     False
       ...
861    False
862     True
863    False
864    False
865    False
866    False
867     True
868    False
869    False
870    False
871     True
872     True
873    False
874    False
875    False
876    False
877    False
878    False
879     True
880    False
881    False
882    False
883    False
884    False
885    False
886    False
887     True
888    False
889     True
890    False
Name: Has_Cabin, Length: 891, dtype: bool

In [11]:
import re
df1['Title']='Special'
for key,value in df1.iterrows():
    df1['Title'][key]=re.findall(r', \w{1,}.',value['Name'])[0][2:]

C:\Users\Admin\Anaconda3\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  after removing the cwd from sys.path.

In [12]:
df1['Title']

0          Mr.
1         Mrs.
2        Miss.
3         Mrs.
4          Mr.
5          Mr.
6          Mr.
7      Master.
8         Mrs.
9         Mrs.
10       Miss.
11       Miss.
12         Mr.
13         Mr.
14       Miss.
15        Mrs.
16     Master.
17         Mr.
18        Mrs.
19        Mrs.
20         Mr.
21         Mr.
22       Miss.
23         Mr.
24       Miss.
25        Mrs.
26         Mr.
27         Mr.
28       Miss.
29         Mr.
        ...
861        Mr.
862       Mrs.
863      Miss.
864        Mr.
865       Mrs.
866      Miss.
867        Mr.
868        Mr.
869    Master.
870        Mr.
871       Mrs.
872        Mr.
873        Mr.
874       Mrs.
875      Miss.
876        Mr.
877        Mr.
878        Mr.
879       Mrs.
880       Mrs.
881        Mr.
882      Miss.
883        Mr.
884        Mr.
885       Mrs.
886       Rev.
887      Miss.
888      Miss.
889        Mr.
890        Mr.
Name: Title, Length: 891, dtype: object

In [13]:
df1=df1.fillna(method='ffill')

In [14]:
df1['Categorical_age']=pd.qcut(df1['Age'], q=4, labels=False)

In [15]:
df1['Age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
5      35.0
6      54.0
7       2.0
8      27.0
9      14.0
10      4.0
11     58.0
12     20.0
13     39.0
14     14.0
15     55.0
16      2.0
17      2.0
18     31.0
19     31.0
20     35.0
21     34.0
22     15.0
23     28.0
24      8.0
25     38.0
26     38.0
27     19.0
28     19.0
29     19.0
       ...
861    21.0
862    48.0
863    48.0
864    24.0
865    42.0
866    27.0
867    31.0
868    31.0
869     4.0
870    26.0
871    47.0
872    33.0
873    47.0
874    28.0
875    15.0
876    20.0
877    19.0
878    19.0
879    56.0
880    25.0
881    33.0
882    22.0
883    28.0
884    25.0
885    39.0
886    27.0
887    19.0
888    19.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [16]:
df1['Categorical_age']

0      1
1      2
2      1
3      2
4      2
5      2
6      3
7      0
8      1
9      0
10     0
11     3
12     0
13     3
14     0
15     3
16     0
17     0
18     2
19     2
20     2
21     2
22     0
23     1
24     0
25     2
26     2
27     0
28     0
29     0
      ..
861    1
862    3
863    3
864    1
865    3
866    1
867    2
868    2
869    0
870    1
871    3
872    2
873    3
874    1
875    0
876    0
877    0
878    0
879    3
880    1
881    2
882    1
883    1
884    1
885    3
886    1
887    0
888    0
889    1
890    2
Name: Categorical_age, Length: 891, dtype: int64

In [17]:
df1['Categorical_fare']=pd.qcut(df1['Fare'], q=4, labels=False)

In [18]:
df1['Categorical_fare']

0      0
1      3
2      1
3      3
4      1
5      1
6      3
7      2
8      1
9      2
10     2
11     2
12     1
13     3
14     0
15     2
16     2
17     1
18     2
19     0
20     2
21     1
22     1
23     3
24     2
25     3
26     0
27     3
28     0
29     0
      ..
861    1
862    2
863    3
864    1
865    1
866    1
867    3
868    1
869    1
870    0
871    3
872    0
873    1
874    2
875    0
876    1
877    0
878    0
879    3
880    2
881    0
882    1
883    1
884    0
885    2
886    1
887    2
888    2
889    2
890    0
Name: Categorical_fare, Length: 891, dtype: int64

In [19]:
df1=df1.drop(['Cabin', 'Name', 'PassengerId', 'Ticket', 'Age', 'Fare', 'SibSp', 'Parch'], axis=1)

In [20]:
df1=pd.get_dummies(df1)

In [21]:
x=df1.iloc[:,[0,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26]]

In [22]:
y=df1.iloc[:,[1]]

In [23]:
from sklearn.cross_validation import train_test_split
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.25,random_state=0)

C:\Users\Admin\Anaconda3\lib\site-packages\sklearn\cross_validation.py:41: DeprecationWarning: This module was deprecated in version 0.18 in favor of the model_selection module into which all the refactored classes and functions are moved. Also note that the interface of the new CV iterators are different from that of this module. This module will be removed in 0.20.
  "This module will be removed in 0.20.", DeprecationWarning)

In [24]:
from sklearn.preprocessing import StandardScaler
sc=StandardScaler()
x_train=sc.fit_transform(x_train)
x_test=sc.transform(x_test)

In [25]:
from sklearn.linear_model import LogisticRegression
regressor=LogisticRegression()
regressor.fit(x_train,y_train)

C:\Users\Admin\Anaconda3\lib\site-packages\sklearn\utils\validation.py:578: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [26]:
y_pred=regressor.predict(x_test).reshape(223,1)

In [27]:
#confusion matrix
from sklearn.metrics import confusion_matrix
cm=confusion_matrix(y_test,y_pred)
cm

array([[115,  24],
       [ 22,  62]], dtype=int64)

In [28]:
from sklearn.metrics import accuracy_score

In [29]:
accuracy_score(y_test, y_pred)

0.7937219730941704